src/Catalogs/Договоры/Договоры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Договоры</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>БезНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСНефиксированнымиЦенами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкруглятьВалютныеЦены</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчётКоличества</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/СпецификацияКДоговоруСПоставщиком/СпецификацияКДоговоруСПоставщиком.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СпецификацияКДоговоруСПоставщиком</name>
  <basedOn>Catalog.Договоры</basedOn>
  <registerRecords>AccumulationRegister.ДоговорыСПоставщиками</registerRecords>
  <registerRecords>InformationRegister.ЦеныПлановые</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Договоры/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Функция НеИмеетДоговоров()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Договоры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.Владелец = &Владелец
	|	И Договоры.ДоговорСНефиксированнымиЦенами = ИСТИНА
	|	И Договоры.ПометкаУдаления = ЛОЖЬ";
Запрос.УстановитьПараметр("Владелец", Объект.Владелец);
РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СпецификацияКДоговоруСПоставщикомТабличнаяЧасть.Цена КАК Цена
		|ИЗ
		|	Документ.СпецификацияКДоговоруСПоставщиком.ТабличнаяЧасть КАК СпецификацияКДоговоруСПоставщикомТабличнаяЧасть
		|ГДЕ
		|	СпецификацияКДоговоруСПоставщикомТабличнаяЧасть.Ссылка.Договор = &Договор
		|	И СпецификацияКДоговоруСПоставщикомТабличнаяЧасть.Ссылка.Проведен = ИСТИНА";
	Запрос.УстановитьПараметр("Договор", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	КонецЕсли; 
Возврат(РезультатЗапроса.Пустой());
КонецФункции

&НаКлиенте
Процедура ДоговорСНефиксированнымиЦенамиПриИзменении(Элемент)
	Если Объект.ДоговорСНефиксированнымиЦенами Тогда
		Если НеИмеетДоговоров() Тогда
		Объект.УчётКоличества = Ложь;		
		Объект.Наименование = "Договор с нефиксированными ценами";		
		Иначе
		Объект.ДоговорСНефиксированнымиЦенами = Ложь;
		Сообщить("Контрагент имеет другие договоры! Создание договора с нефиксированными ценами запрещено!");
		КонецЕсли;  
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура УчётКоличестваПриИзменении(Элемент)
	Если Объект.УчётКоличества Тогда
	Объект.ДоговорСНефиксированнымиЦенами = Ложь;
	КонецЕсли; 
КонецПроцедуры
